import React from 'react';

const PrivacyPolicy = () => {
  return (
    <div className="container mx-auto p-6">
      <h1 className="text-2xl font-bold mb-4">Политика за Поверителност</h1>
      <p className="mb-2">Последна актуализация: 04.10.2024 г.</p>
      <p className="mb-4">
        Настоящата Политика за поверителност описва как събираме, използваме и защитаваме Вашите лични данни, когато използвате платформата на UniklinikBG.
      </p>
      
      <h2 className="text-xl font-semibold mt-4 mb-2">1. Какви Лични Данни Събираме?</h2>
      <p className="mb-4">1.1. Данни за идентификация: име, имейл адрес, телефонен номер</p>
      <p className="mb-4">1.2. Технически данни: IP адрес, данни за устройство, бисквитки.</p>
      
      <h2 className="text-xl font-semibold mt-4 mb-2">2. Как Използваме Вашите Лични Данни?</h2>
      <p className="mb-4">2.1. За предоставяне на услугите и свързване на студенти и пациенти.</p>
      <p className="mb-4">2.2. За комуникация с потребителите относно услугите на платформата.</p>
      <p className="mb-4">2.3. За подобряване на функционалността и сигурността на уебсайта.</p>
      
      <h2 className="text-xl font-semibold mt-4 mb-2">3. На Каква Правна Основа Обработваме Личните Данни?</h2>
      <p className="mb-4">3.1. Съгласие: Обработваме данните въз основа на Вашето изрично съгласие.</p>
      
      <h2 className="text-xl font-semibold mt-4 mb-2">4. С Кого Споделяме Личните Данни?</h2>
      <p className="mb-4">4.1. Личните данни могат да бъдат споделяни с:</p>
      <ul className="list-disc list-inside mb-4">
        <li>Университети и обучителни институции за потвърждение на студентския статус.</li>
      </ul>
      <p className="mb-4">4.2. Ние не продаваме Вашите данни на трети страни.</p>
      
      <h2 className="text-xl font-semibold mt-4 mb-2">5. Сигурност на Данните</h2>
      <p className="mb-4">5.1. Използваме технически и организационни мерки за защита на личните данни от неоторизиран достъп, промяна или унищожение.</p>
      <p className="mb-4">5.2. Достъпът до личните данни е ограничен до служители, които се нуждаят от тази информация.</p>
      
      <h2 className="text-xl font-semibold mt-4 mb-2">6. Вашите Права</h2>
      <p className="mb-4">6.1. Право на достъп: Можете да поискате копие от Вашите лични данни.</p>
      <p className="mb-4">6.2. Право на корекция: Можете да поискате корекция на неточни данни.</p>
      <p className="mb-4">6.3. Право на изтриване: Можете да поискате изтриване на личните данни.</p>
      
      <h2 className="text-xl font-semibold mt-4 mb-2">7. Съхранение на Личните Данни</h2>
      <p className="mb-4">7.1. Съхраняваме личните данни само докато са необходими за предоставяне на услугите или докато имаме законово задължение.</p>
      
      {/* <h2 className="text-xl font-semibold mt-4 mb-2">8. Бисквитки (Cookies)</h2>
      <p className="mb-4">8.1. Използваме бисквитки за подобряване на работата на уебсайта и анализ на потребителското поведение.</p>
      <p className="mb-4">8.2. Можете да контролирате настройките за бисквитките във Вашия браузър.</p> */}
      
      <h2 className="text-xl font-semibold mt-4 mb-2">9. Промени в Политиката за Поверителност</h2>
      <p className="mb-4">9.1. Тази Политика може да бъде актуализирана периодично. Промените ще бъдат обявени на уебсайта.</p>
      
      <h2 className="text-xl font-semibold mt-4 mb-2">10. Контакти</h2>
      <p className="mb-4">Ако имате въпроси или искате да упражните правата си, свържете се с нас на: alengospodinov@gmail.com.</p>
    </div>
  );
};

export default PrivacyPolicy;
